"""Напишите программу, которая считает общую цену. Вводится M рублей и N копеек
цена, а также количество S товара Посчитайте общую цену в рублях и копейках за L
товаров.
Пример:
Input: Цена одной вещи 3 рубля 20 копеек, посчитать 3 предмета.
Output: Общая цена 9 рублей 60 копеек"""

rub = int(input("Сколько рублей стоит товар:  "))  # вводим количество рублей
cent = int(input("Сколько копеек стоит товар: "))  # вводим количество копеек
product = int(input("Сколько товара: "))  # вводим количество товара
_all = ((rub*100)+cent)*product  # считаем сумму всего товара
print("Весь товар стоит", _all // 100, "рубля(ей)", _all % 100, "копейка(ек)")
